interface LiveIconProps {
  className?: string;
}

export function LiveIcon({ className = '' }: LiveIconProps) {
  return (
    <svg
      xmlns="http://www.w3.org/2000/svg"
      width="36"
      height="27"
      viewBox="0 0 36 27"
      fill="none"
      className={className}
      aria-label="라이브"
    >
      <path
        className="fill-coral"
        d="M.5 5.5a5 5 0 0 1 5-5h25a5 5 0 0 1 5 5v16a5 5 0 0 1-5 5h-25a5 5 0 0 1-5-5v-16Z"
      />
      <path
        className="fill-white"
        d="M6.91 18.5V9.309h1.397v7.985h4.152V18.5H6.91Zm6.869 0v-6.894h1.358V18.5H13.78Zm.685-7.96c-.47 0-.863-.355-.863-.8 0-.444.394-.8.863-.8.457 0 .85.356.85.8 0 .445-.393.8-.85.8Zm8.24 1.066L20.203 18.5h-1.46l-2.501-6.894h1.46L19.44 16.9h.063l1.74-5.294h1.46Zm3.834 7.034c-2.032 0-3.276-1.397-3.276-3.542 0-2.12 1.27-3.58 3.187-3.58 1.574 0 3.06.977 3.06 3.465v.483h-4.901c.038 1.307.806 2.057 1.942 2.057.775 0 1.27-.33 1.498-.75h1.371c-.304 1.118-1.37 1.867-2.881 1.867Zm-1.917-4.19h3.554c0-1.053-.673-1.815-1.714-1.815-1.085 0-1.79.838-1.84 1.815Z"
      />
    </svg>
  );
}
